// В заданной строке текста определите количество слов. 
// Каждое слово отделено друг от друга пробелом.
// Console.WriteLine("press something");
// string line = Console.ReadLine();
// string probel = " ";
// int i, kolslov = 1, kolbukv = 0;
// for (i = 0; i != line.Length; i++)
// {
//    if (line[i] != probel[0]) 
//       kolbukv++;
//    else
//       kolslov++;
// }
// Console.WriteLine("your message is: " + line);
// Console.WriteLine("slova {0} bukvi {1}", kolslov, kolbukv);
// Console.ReadKey();

